balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GB106.PIC
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR6" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR6" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP12R" edc:desc="" edc:mask="0x3f" edc:name="RP12R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP13R" edc:desc="" edc:mask="0x3f" edc:name="RP13R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP12R0" edc:desc="" edc:mask="0x1" edc:name="RP12R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R1" edc:desc="" edc:mask="0x1" edc:name="RP12R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R2" edc:desc="" edc:mask="0x1" edc:name="RP12R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R3" edc:desc="" edc:mask="0x1" edc:name="RP12R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R4" edc:desc="" edc:mask="0x1" edc:name="RP12R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP12R5" edc:desc="" edc:mask="0x1" edc:name="RP12R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP13R0" edc:desc="" edc:mask="0x1" edc:name="RP13R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R1" edc:desc="" edc:mask="0x1" edc:name="RP13R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R2" edc:desc="" edc:mask="0x1" edc:name="RP13R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R3" edc:desc="" edc:mask="0x1" edc:name="RP13R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R4" edc:desc="" edc:mask="0x1" edc:name="RP13R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP13R5" edc:desc="" edc:mask="0x1" edc:name="RP13R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPOR7" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000" edc:name="RPOR7" edc:nzwidth="0x10" edc:por="----------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP14R" edc:desc="" edc:mask="0x3f" edc:name="RP14R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP14R0" edc:desc="" edc:mask="0x1" edc:name="RP14R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R1" edc:desc="" edc:mask="0x1" edc:name="RP14R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R2" edc:desc="" edc:mask="0x1" edc:name="RP14R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R3" edc:desc="" edc:mask="0x1" edc:name="RP14R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R4" edc:desc="" edc:mask="0x1" edc:name="RP14R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP14R5" edc:desc="" edc:mask="0x1" edc:name="RP14R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR8" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR8" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP16R" edc:desc="" edc:mask="0x3f" edc:name="RP16R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP17R" edc:desc="" edc:mask="0x3f" edc:name="RP17R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP16R0" edc:desc="" edc:mask="0x1" edc:name="RP16R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R1" edc:desc="" edc:mask="0x1" edc:name="RP16R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R2" edc:desc="" edc:mask="0x1" edc:name="RP16R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R3" edc:desc="" edc:mask="0x1" edc:name="RP16R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R4" edc:desc="" edc:mask="0x1" edc:name="RP16R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP16R5" edc:desc="" edc:mask="0x1" edc:name="RP16R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP17R0" edc:desc="" edc:mask="0x1" edc:name="RP17R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R1" edc:desc="" edc:mask="0x1" edc:name="RP17R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R2" edc:desc="" edc:mask="0x1" edc:name="RP17R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R3" edc:desc="" edc:mask="0x1" edc:name="RP17R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R4" edc:desc="" edc:mask="0x1" edc:name="RP17R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP17R5" edc:desc="" edc:mask="0x1" edc:name="RP17R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR9" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR9" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP18R" edc:desc="" edc:mask="0x3f" edc:name="RP18R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP19R" edc:desc="" edc:mask="0x3f" edc:name="RP19R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP18R0" edc:desc="" edc:mask="0x1" edc:name="RP18R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R1" edc:desc="" edc:mask="0x1" edc:name="RP18R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R2" edc:desc="" edc:mask="0x1" edc:name="RP18R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R3" edc:desc="" edc:mask="0x1" edc:name="RP18R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R4" edc:desc="" edc:mask="0x1" edc:name="RP18R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP18R5" edc:desc="" edc:mask="0x1" edc:name="RP18R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP19R0" edc:desc="" edc:mask="0x1" edc:name="RP19R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R1" edc:desc="" edc:mask="0x1" edc:name="RP19R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R2" edc:desc="" edc:mask="0x1" edc:name="RP19R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R3" edc:desc="" edc:mask="0x1" edc:name="RP19R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R4" edc:desc="" edc:mask="0x1" edc:name="RP19R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP19R5" edc:desc="" edc:mask="0x1" edc:name="RP19R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPOR10" edc:desc="" edc:impl="0x3f3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000--000000" edc:name="RPOR10" edc:nzwidth="0x10" edc:por="--000000--000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RP20R" edc:desc="" edc:mask="0x3f" edc:name="RP20R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP21R" edc:desc="" edc:mask="0x3f" edc:name="RP21R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RP20R0" edc:desc="" edc:mask="0x1" edc:name="RP20R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R1" edc:desc="" edc:mask="0x1" edc:name="RP20R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R2" edc:desc="" edc:mask="0x1" edc:name="RP20R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R3" edc:desc="" edc:mask="0x1" edc:name="RP20R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R4" edc:desc="" edc:mask="0x1" edc:name="RP20R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP20R5" edc:desc="" edc:mask="0x1" edc:name="RP20R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="RP21R0" edc:desc="" edc:mask="0x1" edc:name="RP21R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R1" edc:desc="" edc:mask="0x1" edc:name="RP21R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R2" edc:desc="" edc:mask="0x1" edc:name="RP21R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R3" edc:desc="" edc:mask="0x1" edc:name="RP21R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R4" edc:desc="" edc:mask="0x1" edc:name="RP21R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RP21R5" edc:desc="" edc:mask="0x1" edc:name="RP21R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
